
### :robot: Terraform Report
---
##### Plan: `2` to add, `1` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_repository_permissions.this["fuzzy-engine"] will be created
  + resource "github_actions_repository_permissions" "this" {
      + allowed_actions = "selected"
      + enabled         = true
      + id              = (known after apply)
      + repository      = "fuzzy-engine"

      + allowed_actions_config {
          + github_owned_allowed = true
          + patterns_allowed     = [
              + "ahmadnassri/action-terraform-report@*",
            ]
          + verified_allowed     = true
        }
    }

  # github_repository.repositories["fuzzy-engine"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ allow_auto_merge            = false -> true
      ~ allow_merge_commit          = true -> false
      + archive_on_destroy          = true
      ~ auto_init                   = false -> true
      ~ delete_branch_on_merge      = false -> true
      ~ description                 = "Docker registry UI made with love " -> "Docker registry UI made with love."
      ~ has_downloads               = true -> false
      ~ has_projects                = true -> false
      ~ has_wiki                    = true -> false
      ~ homepage_url                = "https://fuzzy-engine.corentinfiloche.xyz/" -> "https://fuzzy-engine.corentinfiloche.xyz"
        id                          = "fuzzy-engine"
        name                        = "fuzzy-engine"
      ~ topics                      = [
          - "dockerui",
          + "ecr",
          + "ui",
            # (2 unchanged elements hidden)
        ]
      - vulnerability_alerts        = true -> null
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_file.renovate_json["fuzzy-engine"] will be created
  + resource "github_repository_file" "renovate_json" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "master"
      + commit_author                = "Terraform Bot"
      + commit_email                 = "terraform@corentinfiloche.xyz"
      + commit_message               = "chore: create or upgrade renovate configuration"
      + commit_sha                   = (known after apply)
      + content                      = jsonencode(
            {
              + "$schema"           = "https://docs.renovatebot.com/renovate-schema.json"
              + extends             = [
                  + "config:recommended",
                  + "group:allNonMajor",
                ]
              + labels              = [
                  + "renovate",
                ]
              + lockFileMaintenance = {
                  + automerge = true
                  + enabled   = true
                }
              + packageRules        = [
                  + {
                      + automerge           = true
                      + matchCurrentVersion = "!/^0/"
                      + matchUpdateTypes    = [
                          + "minor",
                          + "patch",
                        ]
                    },
                ]
            }
        )
      + file                         = "renovate.json"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "fuzzy-engine"
      + sha                          = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#11314524171`](https://github.com/Tchoupinax/repo-config/actions/runs/11314524171) - commit d382bd9e9cb57b6ca0a694257907cf09d5f2c55d
